import dayjs from 'dayjs'

const locale = {
  name: 'ua',
  weekdays: "неділя_понеділок_вівторок_середа_четвер_п'ятниця_субота".split('_'),
  months: 'січень_лютий_березень_квітень_травень_червень_липень_серпень_вересень_жовтень_листопад_грудень'.split('_'),
  formats: {
    LT: 'H:mm',
    LTS: 'H:mm:ss',
    L: 'DD.MM.YYYY',
    LL: 'D MMMM YYYY р.',
    LLL: 'D MMMM YYYY р., H:mm',
    LLLL: 'dddd, D MMMM YYYY р., H:mm'
  },
  relativeTime: {
    // 3 plural forms for 1 and x1, 2-4 and x2-4, 5-
    pluralRule: 7,
    duration: {
      s: ['кілька секунд'],
      m: ['хвилина', '%d хвилини', '%d хвилин'],
      h: ['годину', '%d години', '%d годин'],
      d: ['день', '%d дні', '%d днів'],
      M: ['місяць', '%d місяці', '%d місяців'],
      y: ['рік', '%d роки', '%d років']
    },
    future: {
      s: ['за кілька секунд'],
      m: ['за хвилину', 'за %d хвилини', 'за %d хвилин'],
      h: ['за годину', 'за %d години', 'за %d годин'],
      d: ['завтра', 'за %d дні', 'за %d днів'],
      M: ['за місяць', 'за %d місяці', 'за %d місяців'],
      y: ['за рік', 'за %d роки', 'за %d років']
    },
    past: {
      s: ['кілька секунд тому'],
      m: ['хвилину тому', '%d хвилини тому', '%d хвилин тому'],
      h: ['годину тому', '%d години тому', '%d годин тому'],
      d: ['вчора', '%d дні тому', '%d днів тому'],
      M: ['місяць тому', '%d місяці тому', '%d місяців тому'],
      y: ['в минулому році', '%d роки тому', '%d років тому']
    }
  },
  ordinal: n => n
}

dayjs.locale(locale, null, true)

export default locale
