import dayjs from 'dayjs'

const locale = {
  name: 'ua',
  weekdays: "неділя_понеділок_вівторок_середа_четвер_п'ятниця_субота".split('_'),
  months: 'січень_лютий_березень_квітень_травень_червень_липень_серпень_вересень_жовтень_листопад_грудень'.split('_'),
  formats: {
    LT: 'H:mm',
    LTS: 'H:mm:ss',
    L: 'DD.MM.YYYY',
    LL: 'D MMMM YYYY р.',
    LLL: 'D MMMM YYYY р., H:mm',
    LLLL: 'dddd, D MMMM YYYY р., H:mm'
  },
  relativeTime: {
    duration: {
      s: 'кілька секунд',
      m: 'хвилина',
      mm: '%d хвилини',
      mmm: '%d хвилин',
      h: 'годину',
      hh: '%d години',
      hhh: '%d годин',
      d: 'день',
      dd: '%d дні',
      ddd: '%d днів',
      M: 'місяць',
      MM: '%d місяці',
      MMM: '%d місяців',
      y: 'рік',
      yy: '%d роки',
      yyy: '%d років'
    },
    future: {
      s: 'за кілька секунд',
      m: 'за хвилину',
      mm: 'за %d хвилини',
      mmm: 'за %d хвилин',
      h: 'за годину',
      hh: 'за %d години',
      hhh: 'за %d годин',
      d: 'завтра',
      dd: 'за %d дні',
      ddd: 'за %d днів',
      M: 'за місяць',
      MM: 'за %d місяці',
      MMM: 'за %d місяців',
      y: 'за рік',
      yy: 'за %d роки',
      yyy: 'за %d років'
    },
    past: {
      s: 'кілька секунд тому',
      m: 'хвилину тому',
      mm: '%d хвилини тому',
      mmm: '%d хвилин тому',
      h: 'годину тому',
      hh: '%d години тому',
      hhh: '%d годин тому',
      d: 'вчора',
      dd: '%d дні тому',
      ddd: '%d днів тому',
      M: 'місяць тому',
      MM: '%d місяці тому',
      MMM: '%d місяців тому',
      y: 'в минулому році',
      yy: '%d роки тому',
      yyy: '%d років тому'
    }
  },
  ordinal: n => n
}

dayjs.locale(locale, null, true)

export default locale